; domain
(define (domain lec-winter-split-macros)
    (:requirements :strips :typing :equality :negative-preconditions)
    (:types match team referee server slot - object)
    (:constants home away - slot)

    (:predicates
        (connected ?m1 - match ?m2 - match ?s - slot)
        (participant ?t - team ?m - match ?s - slot)
        (ref-available ?r - referee)
        (server-available ?s - server)
        
        ;; Predicados de estado necesarios para el grafo
        (verified ?m - match) 
        (winner-determined ?m - match)
        (winner ?m - match ?t - team)
        
        ;; Flag de control
        (has-conflict ?m - match)
    )

    ;; MACRO 1: Partido Normal Completo
    ;; Secuencia: Draft -> PlayClean -> Sign -> Verify
    (:action macro-complete-match-clean
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home) ;; Asumimos gana home
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (not (has-conflict ?m))  ;; Solo si NO hay conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
            ;; Los recursos entran y salen, el estado neto es neutral
        )
    )

    ;; MACRO 2: Partido con Incidencia Resuelta (Ruling)
    ;; Secuencia: Draft -> PlayBug -> Protest -> RulingConfirm -> Sign -> Verify
    (:action macro-complete-match-with-ruling
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (has-conflict ?m)        ;; Solo si HAY conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
        )
    )

    ;; MACRO 3: Partido con Replay (Costoso)
    ;; Secuencia: Draft -> PlayBug -> Protest -> Replay -> PlayClean -> Sign -> Verify
    ;; Nota: Esta macro asume que tras el replay se juega limpio.
    (:action macro-complete-match-with-replay
        :parameters (?m - match ?s - server ?r - referee ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            (ref-available ?r)
            (server-available ?s)
            (has-conflict ?m)        ;; Se dispara por conflicto
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
            ;; En un modelo con costes, aquí pondrías (increase (total-cost) 50)
        )
    )

    ;; MACRO 4: No Show (Administrativo)
    (:action macro-admin-noshow
        :parameters (?m - match ?t - team)
        :precondition (and 
            (participant ?t ?m home)
            (not (verified ?m))
            ;; No requiere recursos
        )
        :effect (and 
            (verified ?m)
            (winner-determined ?m)
            (winner ?m ?t)
        )
    )

    ;; Acción de Avanzar (Igual que en el normal)
    (:action promote-to-next-round
        :parameters (?m_src - match ?m_dst - match ?t - team ?s - slot)
        :precondition (and 
            (winner-determined ?m_src)
            (winner ?m_src ?t)
            (connected ?m_src ?m_dst ?s)
        )
        :effect (and 
            (participant ?t ?m_dst ?s)
        )
    )
)

; problem
(define (problem lec-64-R4-S4-P40)
    (:domain lec-winter-split-macros)
    (:objects
        team-1 team-2 team-3 team-4 team-5 team-6 team-7 team-8 team-9 team-10 team-11 team-12 team-13 team-14 team-15 team-16 team-17 team-18 team-19 team-20 team-21 team-22 team-23 team-24 team-25 team-26 team-27 team-28 team-29 team-30 team-31 team-32 team-33 team-34 team-35 team-36 team-37 team-38 team-39 team-40 team-41 team-42 team-43 team-44 team-45 team-46 team-47 team-48 team-49 team-50 team-51 team-52 team-53 team-54 team-55 team-56 team-57 team-58 team-59 team-60 team-61 team-62 team-63 team-64 - team
        m1 m2 m3 m4 m5 m6 m7 m8 m9 m10 m11 m12 m13 m14 m15 m16 m17 m18 m19 m20 m21 m22 m23 m24 m25 m26 m27 m28 m29 m30 m31 m32 m33 m34 m35 m36 m37 m38 m39 m40 m41 m42 m43 m44 m45 m46 m47 m48 m49 m50 m51 m52 m53 m54 m55 m56 m57 m58 m59 m60 m61 m62 m63 - match
        ref-1 ref-2 ref-3 ref-4 - referee
        server-1 server-2 server-3 server-4 - server
    )
    (:init
        (ref-available ref-1)
        (ref-available ref-2)
        (ref-available ref-3)
        (ref-available ref-4)
        (server-available server-1)
        (server-available server-2)
        (server-available server-3)
        (server-available server-4)
        (participant team-1 m1 home)
        (participant team-2 m1 away)
        (participant team-3 m2 home)
        (participant team-4 m2 away)
        (participant team-5 m3 home)
        (participant team-6 m3 away)
        (participant team-7 m4 home)
        (participant team-8 m4 away)
        (participant team-9 m5 home)
        (participant team-10 m5 away)
        (participant team-11 m6 home)
        (participant team-12 m6 away)
        (participant team-13 m7 home)
        (participant team-14 m7 away)
        (participant team-15 m8 home)
        (participant team-16 m8 away)
        (participant team-17 m9 home)
        (participant team-18 m9 away)
        (participant team-19 m10 home)
        (participant team-20 m10 away)
        (participant team-21 m11 home)
        (participant team-22 m11 away)
        (participant team-23 m12 home)
        (participant team-24 m12 away)
        (participant team-25 m13 home)
        (participant team-26 m13 away)
        (participant team-27 m14 home)
        (participant team-28 m14 away)
        (participant team-29 m15 home)
        (participant team-30 m15 away)
        (participant team-31 m16 home)
        (participant team-32 m16 away)
        (participant team-33 m17 home)
        (participant team-34 m17 away)
        (participant team-35 m18 home)
        (participant team-36 m18 away)
        (participant team-37 m19 home)
        (participant team-38 m19 away)
        (participant team-39 m20 home)
        (participant team-40 m20 away)
        (participant team-41 m21 home)
        (participant team-42 m21 away)
        (participant team-43 m22 home)
        (participant team-44 m22 away)
        (participant team-45 m23 home)
        (participant team-46 m23 away)
        (participant team-47 m24 home)
        (participant team-48 m24 away)
        (participant team-49 m25 home)
        (participant team-50 m25 away)
        (participant team-51 m26 home)
        (participant team-52 m26 away)
        (participant team-53 m27 home)
        (participant team-54 m27 away)
        (participant team-55 m28 home)
        (participant team-56 m28 away)
        (participant team-57 m29 home)
        (participant team-58 m29 away)
        (participant team-59 m30 home)
        (participant team-60 m30 away)
        (participant team-61 m31 home)
        (participant team-62 m31 away)
        (participant team-63 m32 home)
        (participant team-64 m32 away)
        (connected m1 m33 home)
        (connected m2 m33 away)
        (connected m3 m34 home)
        (connected m4 m34 away)
        (connected m5 m35 home)
        (connected m6 m35 away)
        (connected m7 m36 home)
        (connected m8 m36 away)
        (connected m9 m37 home)
        (connected m10 m37 away)
        (connected m11 m38 home)
        (connected m12 m38 away)
        (connected m13 m39 home)
        (connected m14 m39 away)
        (connected m15 m40 home)
        (connected m16 m40 away)
        (connected m17 m41 home)
        (connected m18 m41 away)
        (connected m19 m42 home)
        (connected m20 m42 away)
        (connected m21 m43 home)
        (connected m22 m43 away)
        (connected m23 m44 home)
        (connected m24 m44 away)
        (connected m25 m45 home)
        (connected m26 m45 away)
        (connected m27 m46 home)
        (connected m28 m46 away)
        (connected m29 m47 home)
        (connected m30 m47 away)
        (connected m31 m48 home)
        (connected m32 m48 away)
        (connected m33 m49 home)
        (connected m34 m49 away)
        (connected m35 m50 home)
        (connected m36 m50 away)
        (connected m37 m51 home)
        (connected m38 m51 away)
        (connected m39 m52 home)
        (connected m40 m52 away)
        (connected m41 m53 home)
        (connected m42 m53 away)
        (connected m43 m54 home)
        (connected m44 m54 away)
        (connected m45 m55 home)
        (connected m46 m55 away)
        (connected m47 m56 home)
        (connected m48 m56 away)
        (connected m49 m57 home)
        (connected m50 m57 away)
        (connected m51 m58 home)
        (connected m52 m58 away)
        (connected m53 m59 home)
        (connected m54 m59 away)
        (connected m55 m60 home)
        (connected m56 m60 away)
        (connected m57 m61 home)
        (connected m58 m61 away)
        (connected m59 m62 home)
        (connected m60 m62 away)
        (connected m61 m63 home)
        (connected m62 m63 away)
        (has-conflict m4)
        (has-conflict m6)
        (has-conflict m9)
        (has-conflict m10)
        (has-conflict m11)
        (has-conflict m12)
        (has-conflict m14)
        (has-conflict m17)
        (has-conflict m19)
        (has-conflict m28)
        (has-conflict m32)
        (has-conflict m33)
        (has-conflict m34)
        (has-conflict m37)
        (has-conflict m44)
        (has-conflict m45)
        (has-conflict m47)
        (has-conflict m48)
        (has-conflict m50)
        (has-conflict m52)
        (has-conflict m54)
        (has-conflict m59)
        (has-conflict m60)
        (has-conflict m63)
    )
    (:goal
        (verified m63)
    )
)

; plan
1. (macro-admin-noshow m1 team-1)
   added: (verified m1) (winner-determined m1) (winner m1 team-1)
   goals met: 0 of 1
2. (promote-to-next-round m1 m33 team-1 home)
   added: (participant team-1 m33 home)
   goals met: 0 of 1
3. (macro-admin-noshow m33 team-1)
   added: (verified m33) (winner-determined m33) (winner m33 team-1)
   goals met: 0 of 1
4. (promote-to-next-round m33 m49 team-1 home)
   added: (participant team-1 m49 home)
   goals met: 0 of 1
5. (macro-admin-noshow m49 team-1)
   added: (verified m49) (winner-determined m49) (winner m49 team-1)
   goals met: 0 of 1
6. (promote-to-next-round m49 m57 team-1 home)
   added: (participant team-1 m57 home)
   goals met: 0 of 1
7. (macro-admin-noshow m57 team-1)
   added: (verified m57) (winner-determined m57) (winner m57 team-1)
   goals met: 0 of 1
8. (promote-to-next-round m57 m61 team-1 home)
   added: (participant team-1 m61 home)
   goals met: 0 of 1
9. (macro-admin-noshow m61 team-1)
   added: (verified m61) (winner-determined m61) (winner m61 team-1)
   goals met: 0 of 1
10. (promote-to-next-round m61 m63 team-1 home)
   added: (participant team-1 m63 home)
   goals met: 0 of 1
11. (macro-admin-noshow m63 team-1)
   added: (verified m63) (winner-determined m63) (winner m63 team-1)
   goals met: 1 of 1
